---
kind: method
id: M:Autodesk.Revit.DB.TransactionGroup.GetName
source: html/58789072-9fe1-a08d-7b3b-1c28239e6115.htm
---
# Autodesk.Revit.DB.TransactionGroup.GetName Method

Returns the transaction group's name. It could be an empty string.

## Syntax (C#)
```csharp
public string GetName()
```

## Returns
The transaction group's current name.